// Дальше идет объявление массива объектов с двумя полями:
// "text" -- текст афоризма
// "author" -- автор афоризма (не обязательный)
// Мы будем рандомом выбирать один из объектов из массива и возвращать его
// Синтаксис "module.exports = " позволяет вернуть объект из модуля, чтобы подтянуть его в файле index.js через require
module.exports = [
  {
    text: 'Не ищи ошибку; ищи, как ее исправить.',
    author: 'Форд Генри'
  },
  {
    text: 'Приходите - поможем! Того, кто не задумывается о далеких трудностях, поджидают близкие неприятности.',
    author: 'Конфуций'
  },
  {
    text: '«Таланты образуются в покое, характеры — среди житейских бурь».',
    author: 'Иоганн Гёте'
  },
  {
    text: 'Если падаешь со скалы, попробуй взлететь: терять тебе все равно нечего.'
  },
  {
    text: 'Одни, когда видят пропасть, думают о бездне, а другие представляют мост через нее.'
  },
  {
    text: 'Отказаться от риска - значит отказаться от творчества.',
    author: 'А. Макаренко'
  },
  {
    text: 'Если ты споткнулся и упал, это еще не значит, что ты идешь не туда.'
  },
  {
    text: 'Когда одна дверь счастья закрывается, открывается другая; но мы часто не замечаем ее, уставившись взглядом в закрытую дверь.',
    author: 'Хелен Келлер'
  },
  {
    text: 'Тот, у кого из всех орудий есть только молоток, склонен на любую проблему смотреть, как на гвоздь.',
    author: 'Абрахам Маслоу'
  },
  {
    text: 'Идти на уступки врагам все равно, что кормить крокодила, который сожрет вас последним.',
    author: 'Уинстон Черчилль'
  },
  {
    text: 'Если вам плюют в спину, значит вы идете впереди.',
    author: 'Конфуций'
  },
  {
    text: 'Лодке в гавани безопаснее, чем в море, но она не для этого строилась.',
    author: 'Бодо Шефер'
  },
  {
    text: 'Всегда не хватает времени, чтобы выполнить работу как надо, но на то, чтобы ее переделать, время находится.'
  },
  {
    text: '"С нами такого случиться не может" - это фраза номер один в списке знаменитых последних слов.',
    author: 'Дэвид Кросби'
  },
  {
    text: 'Ложный шаг не раз приводил к открытию новых дорог.',
    author: 'Лешек Кумор'
  },
  {
    text: 'Не ошибается тот, кто ничего не делает, хотя это и есть его основная ошибка.',
    author: 'Толстой А. Н.'
  },
  {
    text: 'Только слабых смиряют и подавляют неудачи; великие характеры взлетают над ними.',
    author: 'В. Ирвинг'
  },
  {
    text: 'Компьютеры бесподобны: за несколько минут они могут совершить такую грандиозную ошибку, какую не в состоянии ' +
    'сделать множество людей за многие месяцы.',
    author: 'М.Мичэм'
  },
  {
    text: 'Стена — это та же ступень. Просто надо дорасти до нее'
  },
  {
    text: 'Никогда не улыбайтесь репортерам… Как только ваше дело постигнет неудача, Вы увидите свою улыбку на первой полосе.'
  },
  {
    text: 'Если потерпите неудачу - будете огорчены; если опустите руки - обречены.',
    author: 'Биверли Силлз'
  },
  {
    text: 'Откапывая ошибки, теряют время, которое, быть может, употребили бы на открытие истин.',
    author: 'Вольтер'
  },
  {
    text: 'Когда вам становится очень туго, и все оборачивается против вас, И, кажется, нет сил терпеть ни одной минуты, Ни ' +
    'за что не отступайте -- именно в такие моменты наступает перелом в борьбе.',
    author: 'В. Стоун'
  },
  {
    text: 'Закройте дверь перед всеми ошибками, и истина не сможет войти.',
    author: 'Рабиндранат Тагор'
  }
];
